---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
source: html/3604ada3-b09e-c40c-530e-9be4d88cd59e.htm
---
# EnergyAnalysisSurface Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.